Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СуммаВыкупаКлиента Приход
	Движения.СуммаВыкупаКлиента.Записывать = Истина;
	Движение = Движения.СуммаВыкупаКлиента.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Покупатель = Клиент;
	Движение.Сумма_выкупа = СуммаБезСкидки;
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
 	Для Каждого ТекСтрокаНоменклатуры Из Товары Цикл
  		Остаток = ОстаткиНоменклатуры(ТекСтрокаНоменклатуры.Товар);
  	Если Остаток - ТекСтрокаНоменклатуры.Количество < 0 Тогда
   		ВызватьИсключение "Остаток товара " + ТекСтрокаНоменклатуры.Товар + " должно быть >= 0! Текущий остаток: " + Остаток;
	КонецЕсли;
	
  	Движение = Движения.ОстаткиНоменклатуры.Добавить();
  	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
  	Движение.Период = Дата;
  	Движение.Номенклатура = ТекСтрокаНоменклатуры.Товар;
  	Движение.Количество = ТекСтрокаНоменклатуры.Количество;
 КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 

// Функция получения остатков товара
Функция ОстаткиНоменклатуры(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&Дата, Номенклатура = &Номенклатура) КАК ОстаткиНоменклатурыОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

