
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаНоменклатуры Из Номенклатуры Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаНоменклатуры.Номенклатура;
		Движение.Количество = вМетры(ТекСтрокаНоменклатуры.Количество, ТекСтрокаНоменклатуры.ЕдиницаИзмерения);
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Функция вМетры(Количество, ЕдиницаИзмерения)
	Если ЕдиницаИзмерения = Перечисления.ЕдиницыИзмерения.КоробкаКатушек Тогда     
		Возврат 100 * вКатушки(Количество, ЕдиницаИзмерения);
	КонецЕсли;
	Если ЕдиницаИзмерения = Перечисления.ЕдиницыИзмерения.катушка Тогда     
		Возврат 100 * Количество;
	КонецЕсли;
	
	Возврат Количество;
КонецФункции

Функция вКатушки(Количество, ЕдиницаИзмерения)
	Если ЕдиницаИзмерения = Перечисления.ЕдиницыИзмерения.КоробкаКатушек Тогда     
		Возврат 100 * Количество;
	КонецЕсли;
	
	Возврат Количество;
КонецФункции


