
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПоставкаТовара.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоставкаТовара.Дата,
	|	ПоставкаТовара.Номер,
	|	ПоставкаТовара.Номенклатуры.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество
	|	)
	|ИЗ
	|	Документ.ПоставкаТовара КАК ПоставкаТовара
	|ГДЕ
	|	ПоставкаТовара.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНоменклатурыШапка = Макет.ПолучитьОбласть("НоменклатурыШапка");
	ОбластьНоменклатуры = Макет.ПолучитьОбласть("Номенклатуры");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНоменклатурыШапка);
		ВыборкаНоменклатуры = Выборка.Номенклатуры.Выбрать();
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			ОбластьНоменклатуры.Параметры.Заполнить(ВыборкаНоменклатуры);
			ТабДок.Вывести(ОбластьНоменклатуры, ВыборкаНоменклатуры.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
