// В модуле ФОРМЫ документа
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Объект.СкидкаКлиента = ПолучитьСкидкуКлиента();
	// Считаем сумму одного товара
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;   
	Если ТекущаяСтрока.Товар <> Неопределено Тогда
		Цена = ПолучитьЦенуНаСервере(ТекущаяСтрока.Товар, Объект.Дата);
		СуммаБезСкидки = Цена * ТекущаяСтрока.Количество;
		ТекущаяСтрока.СуммаБезСкидки = СуммаБезСкидки;
		ТекущаяСтрока.Сумма = СуммаБезСкидки - (СуммаБезСкидки * Объект.СкидкаКлиента / 100);
	КонецЕсли;
	
	// Пересчет общей суммы
	ОбщаяСумма = 0;
	ОбщаяСуммаБезСкидки = 0;
	Для Каждого Стр Из Объект.Товары Цикл
		ОбщаяСумма = ОбщаяСумма + Стр.Сумма;
		ОбщаяСуммаБезСкидки = ОбщаяСуммаБезСкидки + Стр.СуммаБезСкидки;
	КонецЦикла;  
		
	Объект.Сумма = ОбщаяСумма;
	Объект.СуммаБезСкидки = ОбщаяСуммаБезСкидки;
	
КонецПроцедуры       

&НаСервере
Функция ПолучитьЦенуНаСервере(Номенклатура, Дата)
	// Составляем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    ЦеныНоменклатуры.Цена КАК Цена
	|ИЗ
	|    РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|   ЦеныНоменклатуры.Номенклатура = &Номенклатура
	|И
	|   ЦеныНоменклатуры.Период <= &Дата
	|УПОРЯДОЧИТЬ ПО
	|    Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	// Обработка результата
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Возврат Результат.Цена;
	КонецЦикла;	   
	
	Возврат 0;
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьСуммуВыкупа(Клиент, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 

	 "ВЫБРАТЬ
	 |	СуммаВыкупаКлиентаОстатки.Сумма_выкупаОстаток КАК Сумма_выкупаОстаток
	 |ИЗ
	 |	РегистрНакопления.СуммаВыкупаКлиента.Остатки(&Дата, Покупатель = &Покупатель) КАК СуммаВыкупаКлиентаОстатки";
	 
	 Запрос.УстановитьПараметр("Покупатель", Клиент);  
	 Запрос.УстановитьПараметр("Дата", Дата); 
	 
	Результат = Запрос.Выполнить().Выбрать();     
	
	Пока Результат.Следующий() Цикл
		Возврат Результат.Сумма_выкупаОстаток;
	КонецЦикла;

КонецФункции


&НаКлиенте
Функция ПолучитьСкидкуКлиента()  
	СуммаВыкупа = ПолучитьСуммуВыкупа(Объект.Клиент, Объект.Дата); 
	Если не ТипЗнч(СуммаВыкупа)= ТИП("Неопределено") тогда
		Если СуммаВыкупа >= 30000 Тогда
			Возврат 10;
		КонецЕсли;
		Если СуммаВыкупа >= 15000 Тогда
			Возврат 5;
		КонецЕсли;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.СкидкаКлиента = ПолучитьСкидкуКлиента();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении()
	Объект.СкидкаКлиента = ПолучитьСкидкуКлиента();
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Для Каждого Стр Из Объект.Товары Цикл
		ТоварыНоменклатураПриИзменении(ТекущаяСтрока.Товар);
		Возврат
	КонецЦикла;
	
	
КонецПроцедуры   
