// В модуле ФОРМЫ документа
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	// Считаем сумму одного товара
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;   
	Если ТекущаяСтрока.Товар <> Неопределено Тогда
		Цена = ПолучитьЦенуНаСервере(ТекущаяСтрока.Товар, Объект.Дата);
		ТекущаяСтрока.Сумма = Цена * ТекущаяСтрока.Количество;
	КонецЕсли;
	
	// Пересчет общей суммы
	ОбщаяСумма = 0;
	Для Каждого Стр Из Объект.Товары Цикл
		ОбщаяСумма = ОбщаяСумма + Стр.Сумма;		
	КонецЦикла;
	Объект.Сумма = ОбщаяСумма;
	
КонецПроцедуры       

&НаСервере
Функция ПолучитьЦенуНаСервере(Номенклатура, Дата)
	// Составляем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    ЦеныНоменклатуры.Цена КАК Цена
	|ИЗ
	|    РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|   ЦеныНоменклатуры.Номенклатура = &Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|    Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	// Обработка результата
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Возврат Результат.Цена;
	КонецЦикла;	   
	
	Возврат 0;
КонецФункции